Картотека1/src/Documents/трс_ВыбытиеОбъекта/трс_ВыбытиеОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>трс_ВыбытиеОбъекта</name>
  <registerRecords>InformationRegister.трс_ПереходыОбъектовНедвижимости</registerRecords>
  <attributes>
    <name>ПричинаВыбытия</name>
    <type>
      <types>EnumRef.трс_ПричинаВыбытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>CatalogRef.трс_ДоговорЗалога</types>
      <types>CatalogRef.трс_СитуационныйПлан</types>
      <types>CatalogRef.трс_ДоговорАренды</types>
      <types>CatalogRef.трс_АктПриемаПередачи</types>
      <types>CatalogRef.трс_ПисьмоОрганов</types>
      <types>CatalogRef.трс_ТехническийПлан</types>
      <types>CatalogRef.трс_РазрешениеНаСтроительство</types>
      <types>CatalogRef.трс_СхемаРазмещения</types>
      <types>CatalogRef.трс_Декларация</types>
      <types>CatalogRef.трс_ФайловыйДокумент</types>
      <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
      <types>CatalogRef.трс_Справка</types>
      <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
      <types>CatalogRef.трс_КадастровыйПаспорт</types>
      <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
      <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
      <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
      <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
      <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
      <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
      <types>CatalogRef.трс_ТехническийПаспорт</types>
      <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
      <types>CatalogRef.трс_ПроектРеконструкции</types>
      <types>CatalogRef.трс_МежевойПлан</types>
      <types>CatalogRef.трс_ДополнительноеСоглашение</types>
      <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
      <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
      <types>CatalogRef.трс_ДоговорДарения</types>
      <types>CatalogRef.трс_ТехническоеЗаключение</types>
      <types>CatalogRef.трс_ДоговорМены</types>
      <types>CatalogRef.трс_ДоговорСубаренды</types>
      <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
      <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйПравообладатель</name>
    <type>
      <types>CatalogRef.трс_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбывающийОбъект</name>
    <type>
      <types>CatalogRef.трс_НедвижимоеИмущество</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛиквидацияОбъектаНедвижимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеДокументы</name>
    <attributes>
      <name>ДополнительныйДокумент</name>
      <type>
        <types>CatalogRef.трс_ДоговорЗалога</types>
        <types>CatalogRef.трс_СитуационныйПлан</types>
        <types>CatalogRef.трс_ДоговорАренды</types>
        <types>CatalogRef.трс_АктПриемаПередачи</types>
        <types>CatalogRef.трс_ПисьмоОрганов</types>
        <types>CatalogRef.трс_ТехническийПлан</types>
        <types>CatalogRef.трс_РазрешениеНаСтроительство</types>
        <types>CatalogRef.трс_СхемаРазмещения</types>
        <types>CatalogRef.трс_Декларация</types>
        <types>CatalogRef.трс_ФайловыйДокумент</types>
        <types>CatalogRef.трс_СправкаОКадастровойСтоимости</types>
        <types>CatalogRef.трс_Справка</types>
        <types>CatalogRef.трс_УведомлениеОЗавершенииСтроительства</types>
        <types>CatalogRef.трс_КадастровыйПаспорт</types>
        <types>CatalogRef.трс_ВыпискаИзЕГРН</types>
        <types>CatalogRef.трс_СвидетельствоНаПравоСобственности</types>
        <types>CatalogRef.трс_УведомлениеОНачалеСтроительства</types>
        <types>CatalogRef.трс_СвидетельствоОНаследстве</types>
        <types>CatalogRef.трс_РазрешениеНаВводВЭксплуатацию</types>
        <types>CatalogRef.трс_РешениеСобственникаОРазделе</types>
        <types>CatalogRef.трс_ТехническийПаспорт</types>
        <types>CatalogRef.трс_ВыпискаИзИСОГД</types>
        <types>CatalogRef.трс_ПроектРеконструкции</types>
        <types>CatalogRef.трс_МежевойПлан</types>
        <types>CatalogRef.трс_ДополнительноеСоглашение</types>
        <types>CatalogRef.трс_СоглашенияОбУступкеПрав</types>
        <types>CatalogRef.трс_ДоговорДолевогоУчастия</types>
        <types>CatalogRef.трс_ДоговорДарения</types>
        <types>CatalogRef.трс_ТехническоеЗаключение</types>
        <types>CatalogRef.трс_ДоговорМены</types>
        <types>CatalogRef.трс_ДоговорСубаренды</types>
        <types>CatalogRef.трс_ПостановлениеОПредоставленииЗемельногоУчастка</types>
        <types>CatalogRef.трс_ДоговорКуплиПродажи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картотека1/src/Enums/трс_ТипНедвижимости/трс_ТипНедвижимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>трс_ТипНедвижимости</name>
  <enumValues>
    <name>ОбъектКапитальногоСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйУчасток</name>
  </enumValues>
</mdclass:Enum>

Картотека1/src/Documents/трс_ВыбытиеОбъекта/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций

&НаСервере
Процедура ЛиквидацияОбъектаНедвижимостиПриИзмененииНаСервере()
	Элементы.НовыйПравообладатель.Видимость = Не Объект.ЛиквидацияОбъектаНедвижимости;
	Если Объект.ЛиквидацияОбъектаНедвижимости Тогда
		Объект.НовыйПравообладатель = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛиквидацияОбъектаНедвижимостиПриИзменении(Элемент)
	ЛиквидацияОбъектаНедвижимостиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбывающийОбъектПриИзменении(Элемент)
	ПроверкаТипаНедвижимости();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПроверкаТипаНедвижимости()

	Если Объект.ВыбывающийОбъект.ТипНедвижимости = Перечисления.трс_ТипНедвижимости.ЗемельныйУчасток Тогда
		Элементы.ЛиквидацияОбъектаНедвижимости.Видимость = Ложь;
		Объект.ЛиквидацияОбъектаНедвижимости = Ложь;
	Иначе
		Элементы.ЛиквидацияОбъектаНедвижимости.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры // ПроверкаТипаНедвижимости()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроверкаТипаНедвижимости();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверкаТипаНедвижимости();
КонецПроцедуры

&НаКлиенте
Процедура НовыйПравообладательПриИзменении(Элемент)
	ПроверкаНовогоПравообладателя();
КонецПроцедуры

&НаСервере
Процедура ПроверкаНовогоПравообладателя()

		
	Если Не Объект.НовыйПравообладатель = Неопределено Тогда
		Элементы.ЛиквидацияОбъектаНедвижимости.Видимость = Ложь;
		Объект.ЛиквидацияОбъектаНедвижимости = Ложь;
	КонецЕсли;

КонецПроцедуры // ПроверкаНовогоПравообладателя()


#КонецОбласти
